using HDF5
using Interpolations

function generate_data()

    fname = "src/c182t_aero.h5"

    h5open(fname, "w") do fid

        create_group(fid, "C_D")
        create_group(fid, "C_Y")
        create_group(fid, "C_L")

        C_D = fid["C_D"]

        C_D["zero"] = 0.027
        C_D["β"] = 0.17
        C_D["δe"] = 0.06

        create_group(C_D, "ge")
        C_D["ge"]["Δh_nd"] = [ 0.0000 0.1000 0.1500 0.2000 0.3000 0.4000 0.5000 0.6000 0.7000 0.8000 0.9000 1.0000 1.1000 ] |> vec
        C_D["ge"]["k"] = [ 0.4800 0.5150 0.6290 0.7090 0.8150 0.8820 0.9280 0.9620 0.9880 1.0000 1.0000 1.0000 1.0000 ] |> vec

        create_group(C_D, "δf")
        C_D["δf"]["δf"] = deg2rad.([ 0.0000	10.0000 20.0000 30.0000 ]) |> vec
        C_D["δf"]["C_D"] = [ 0.0000 0.0070 0.0120 0.0180 ] |> vec

        create_group(C_D, "α_δf")
        C_D["α_δf"]["α"] = [ -0.0873 -0.0698 -0.0524 -0.0349 -0.0175 0.0000	0.0175	0.0349	0.0524	0.0698	0.0873 0.1047	0.1222	0.1396	0.1571	0.1745	0.1920	0.2094	0.2269	0.2443	0.2618	0.2793	0.2967	0.3142	0.3316	0.3491] |> vec
        C_D["α_δf"]["δf"] = deg2rad.([ 0.0000	10.0000	20.0000	30.0000 ]) |> vec
        C_D["α_δf"]["C_D"] = [ 0.0041	0.0000	0.0005	0.0014
                                0.0013	0.0004	0.0025	0.0041
                                0.0001	0.0023	0.0059	0.0084
                                0.0003	0.0057	0.0108	0.0141
                                0.0020	0.0105	0.0172	0.0212
                                0.0052	0.0168	0.0251	0.0299
                                0.0099	0.0248	0.0346	0.0402
                                0.0162	0.0342	0.0457	0.0521
                                0.0240	0.0452	0.0583	0.0655
                                0.0334	0.0577	0.0724	0.0804
                                0.0442	0.0718	0.0881	0.0968
                                0.0566	0.0874	0.1053	0.1148
                                0.0706	0.1045	0.1240	0.1343
                                0.0860	0.1232	0.1442	0.1554
                                0.0962	0.1353	0.1573	0.1690
                                0.1069	0.1479	0.1708	0.1830
                                0.1180	0.1610	0.1849	0.1975
                                0.1298	0.1746	0.1995	0.2126
                                0.1424	0.1892	0.2151	0.2286
                                0.1565	0.2054	0.2323	0.2464
                                0.1727	0.2240	0.2521	0.2667
                                0.1782	0.2302	0.2587	0.2735
                                0.1716	0.2227	0.2507	0.2653
                                0.1618	0.2115	0.2388	0.2531
                                0.1475	0.1951	0.2214	0.2351
                                0.1097	0.1512	0.1744	0.1866
        ]

    end

end

function load_data()

    fname = "src/c182t_aero.h5"
    fid = h5open(fname, "r")

    gr_C_D = fid["C_D"]
    gr_C_L = fid["C_L"]

    C_D = (
        z = gr_C_D["zero"] |> read,
        β = gr_C_D["β"] |> read,
        δe = gr_C_D["δe"] |> read,
        δf = LinearInterpolation(gr_C_D["δf"]["δf"] |> read, gr_C_D["δf"]["C_D"] |> read, extrapolation_bc = Flat()),
        α_δf = LinearInterpolation((gr_C_D["α_δf"]["α"] |> read,  gr_C_D["α_δf"]["δf"] |> read), gr_C_D["α_δf"]["C_D"] |> read, extrapolation_bc = Flat()),
        ge = LinearInterpolation(gr_C_D["ge"]["Δh_nd"] |> read, gr_C_D["ge"]["k"] |> read, extrapolation_bc = Flat())
    )

    close(fid)

    coefs = (C_D = C_D, C_L = C_L)

    return coefs

end
